app/controllers/products_controller.rb

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def show
    @product = Product.find(params[:id])

SELECT * FROM `products` WHERE (`products`.`id` = 2)
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO `products` (`price`, `created_at`, `title`, `image_url`, `updated_at`, `description`) VALUES(12, '2010-11-22 07:11:33', 'ebook no 2', '/img/2.jpg', '2010-11-22 07:11:33', '2nd ebook')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM `products` WHERE (`products`.`id` = 2)
UPDATE `products` SET `updated_at` = '2010-11-23 08:38:49', `description` = 'Pragmatic Project Automation shows you how to improve the consistency and repeatability of your project\'s procedures using automation to reduce risk and errors.\r\n\r\n Simply put, we\'re going to put this thing called a computer to work for you doing the mundane (but important) project stuff. That means you\'ll have more time and energy to do the really exciting---and difficult---stuff, like writing quality code.' WHERE `id` = 4
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT * FROM `products` WHERE (`products`.`id` = 4)
DELETE FROM `products` WHERE `id` = 4
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy