app/controllers/store_controller.rb

SELECT * FROM `products` ORDER BY title
---
  def index
    @products = Product.find_products_for_sale

SELECT * FROM `products` WHERE (`products`.`id` = 6)
---
def add_to_cart
begin
  product = Product.find(params[:id])

INSERT INTO `line_items` (`created_at`, `product_id`, `quantity`, `order_id`, `total_price`, `updated_at`) VALUES('2010-12-01 07:55:24', 6, 1, 1, 27.0, '2010-12-01 07:55:24')
INSERT INTO `orders` (`name`, `address`, `created_at`, `updated_at`, `pay_type`, `email`) VALUES('sri', 'abc', '2010-12-01 07:55:24', '2010-12-01 07:55:24', 'check', 'abc')
---
  def save_order
    @cart = find_cart
    @order = Order.new(params[:order]) # creating an object of all data in the form
    @order.add_line_items_from_cart(@cart)
    if @order.save