app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `created_at`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `remember_token`, `login`, `email`) VALUES('', 'bf136f28dba0c1d9aa31bebc642df9e18fa7fb80', '2010-11-22 10:30:42', '0d11d51f02f51ff0347e3448912a9194aa7cb24c', NULL, '2010-11-22 10:30:42', NULL, 'sriram', 'sriramkala@gmail.com')